--
-- PostgreSQL database dump
--

-- Dumped from database version 14.17 (Homebrew)
-- Dumped by pg_dump version 14.17 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: get_next_available_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.get_next_available_id() RETURNS integer
    LANGUAGE plpgsql
    AS $$
DECLARE
    next_id INTEGER;
BEGIN
    SELECT MIN(t1.id + 1) INTO next_id
    FROM drivers t1
    WHERE NOT EXISTS (
        SELECT 1 
        FROM drivers t2 
        WHERE t2.id = t1.id + 1
    );
    
    IF next_id IS NULL THEN
        SELECT COALESCE(MAX(id) + 1, 1) INTO next_id
        FROM drivers;
    END IF;
    
    RETURN next_id;
END;
$$;


ALTER FUNCTION public.get_next_available_id() OWNER TO postgres;

--
-- Name: set_customer_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.set_customer_id() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
BEGIN
    IF NEW.id IS NULL THEN
        NEW.id = get_next_available_id();
    END IF;
    RETURN NEW;
END;
$$;


ALTER FUNCTION public.set_customer_id() OWNER TO postgres;

--
-- Name: set_driver_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.set_driver_id() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
BEGIN
    IF NEW.id IS NULL THEN
        NEW.id = get_next_available_id();
    END IF;
    RETURN NEW;
END;
$$;


ALTER FUNCTION public.set_driver_id() OWNER TO postgres;

--
-- Name: set_schedule_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.set_schedule_id() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
BEGIN
    IF NEW.id IS NULL THEN
        NEW.id = get_next_available_id();
    END IF;
    RETURN NEW;
END;
$$;


ALTER FUNCTION public.set_schedule_id() OWNER TO postgres;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: completed_trips; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.completed_trips (
    id integer NOT NULL,
    date date NOT NULL,
    start_point character varying(100),
    via_point character varying(100),
    end_point character varying(100),
    meter_fare integer,
    extra_fare integer,
    actual_fare integer GENERATED ALWAYS AS (
CASE
    WHEN ((meter_fare IS NOT NULL) AND (extra_fare IS NOT NULL)) THEN (meter_fare + extra_fare)
    WHEN (meter_fare IS NOT NULL) THEN meter_fare
    ELSE NULL::integer
END) STORED,
    category character varying(50),
    driver_id integer,
    remarks text,
    created_at timestamp without time zone DEFAULT CURRENT_TIMESTAMP,
    unique_code character varying(30)
);


ALTER TABLE public.completed_trips OWNER TO postgres;

--
-- Name: completed_trips_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.completed_trips_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.completed_trips_id_seq OWNER TO postgres;

--
-- Name: completed_trips_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.completed_trips_id_seq OWNED BY public.completed_trips.id;


--
-- Name: customers; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.customers (
    id integer NOT NULL,
    name character varying(100) NOT NULL,
    address character varying(200) NOT NULL,
    short_name character varying(50),
    category character varying(50),
    remarks text
);


ALTER TABLE public.customers OWNER TO postgres;

--
-- Name: customers_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.customers_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.customers_id_seq OWNER TO postgres;

--
-- Name: drivers; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.drivers (
    id integer NOT NULL,
    name character varying(50) NOT NULL,
    plate_number character varying(20),
    car_brand character varying(50),
    car_model character varying(50)
);


ALTER TABLE public.drivers OWNER TO postgres;

--
-- Name: fixed_schedules; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.fixed_schedules (
    id integer NOT NULL,
    route_number character varying(10),
    departure_time time without time zone NOT NULL,
    start_point character varying(100),
    via_point character varying(100),
    end_point character varying(100),
    base_fare integer,
    surcharge integer,
    total_fare integer GENERATED ALWAYS AS (
CASE
    WHEN ((base_fare IS NOT NULL) AND (surcharge IS NOT NULL)) THEN (base_fare + surcharge)
    WHEN (base_fare IS NOT NULL) THEN base_fare
    ELSE NULL::integer
END) STORED,
    category character varying(50),
    driver_id character varying(10),
    direction character varying(1)
);


ALTER TABLE public.fixed_schedules OWNER TO postgres;

--
-- Name: persons; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.persons (
    id integer NOT NULL,
    name character varying(100) NOT NULL,
    contact character varying(100),
    email character varying(200),
    role character varying(50),
    remarks text
);


ALTER TABLE public.persons OWNER TO postgres;

--
-- Name: persons_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.persons_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.persons_id_seq OWNER TO postgres;

--
-- Name: persons_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.persons_id_seq OWNED BY public.persons.id;


--
-- Name: trips; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.trips (
    trip_id integer NOT NULL,
    fixed_trip_id integer,
    week_number integer,
    date date,
    "time" time without time zone,
    start_point character varying(100),
    via_point character varying(100),
    end_point character varying(100),
    meter_fare integer,
    extra_fare integer,
    actual_fare integer GENERATED ALWAYS AS (
CASE
    WHEN ((meter_fare IS NOT NULL) AND (extra_fare IS NOT NULL)) THEN (meter_fare + extra_fare)
    WHEN (meter_fare IS NOT NULL) THEN meter_fare
    ELSE NULL::integer
END) STORED,
    category character varying(50),
    driver_id integer,
    status character varying(20),
    unique_code character varying(30)
);


ALTER TABLE public.trips OWNER TO postgres;

--
-- Name: trips_trip_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.trips_trip_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.trips_trip_id_seq OWNER TO postgres;

--
-- Name: trips_trip_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.trips_trip_id_seq OWNED BY public.trips.trip_id;


--
-- Name: completed_trips id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips ALTER COLUMN id SET DEFAULT nextval('public.completed_trips_id_seq'::regclass);


--
-- Name: persons id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.persons ALTER COLUMN id SET DEFAULT nextval('public.persons_id_seq'::regclass);


--
-- Name: trips trip_id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips ALTER COLUMN trip_id SET DEFAULT nextval('public.trips_trip_id_seq'::regclass);


--
-- Data for Name: completed_trips; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.completed_trips (id, date, start_point, via_point, end_point, meter_fare, extra_fare, category, driver_id, remarks, created_at, unique_code) FROM stdin;
202	2025-03-10	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-17 13:31:28.608363	5_69_11
203	2025-03-10	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-17 13:31:28.608363	7_69_11
204	2025-03-10	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-17 13:31:28.608363	8_69_11
205	2025-03-10	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-17 13:31:28.608363	10_69_11
206	2025-03-10	診所	\N	安定	500	\N	診所	5386	\N	2025-03-17 13:31:28.608363	12_69_11
207	2025-03-10	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-17 13:31:28.608363	13_69_11
208	2025-03-10	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-17 13:31:28.608363	16_69_11
209	2025-03-10	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-17 13:31:28.608363	19_69_11
210	2025-03-10	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-17 13:31:28.608363	20_69_11
211	2025-03-10	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-17 13:31:28.608363	21_69_11
212	2025-03-10	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-17 13:31:28.608363	2_69_11
213	2025-03-10	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-17 13:31:28.608363	3_69_11
214	2025-03-10	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-17 13:31:28.608363	4_69_11
215	2025-03-10	永大路	\N	診所	280	\N	診所	533	\N	2025-03-17 13:31:28.608363	6_69_11
216	2025-03-10	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-17 13:31:28.608363	9_69_11
217	2025-03-10	安定	\N	診所	500	\N	診所	5386	\N	2025-03-17 13:31:28.608363	11_69_11
218	2025-03-10	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-17 13:31:28.608363	14_69_11
219	2025-03-10	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-17 13:31:28.608363	15_69_11
220	2025-03-10	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-17 13:31:28.608363	17_69_11
221	2025-03-10	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-17 13:31:28.608363	18_69_11
222	2025-03-10	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-17 13:31:28.608363	38_69_11
223	2025-03-10	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-17 13:31:28.608363	42_69_11
224	2025-03-10	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-17 13:31:28.608363	1_69_11
225	2025-03-11	馬鎮宮	\N	診所	330	\N	診所	61553	\N	2025-03-17 13:44:39.666376	29_70_11
226	2025-03-11	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-17 13:44:39.666376	30_70_11
227	2025-03-11	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-17 13:44:39.666376	31_70_11
228	2025-03-11	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-17 13:44:39.666376	36_70_11
229	2025-03-11	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-17 13:44:39.666376	23_70_11
230	2025-03-11	信智	\N	診所	140	\N	診所	61553	\N	2025-03-17 13:44:39.666376	32_70_11
231	2025-03-11	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-17 13:44:39.666376	33_70_11
232	2025-03-11	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-17 13:44:39.666376	35_70_11
233	2025-03-11	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-17 13:44:39.666376	22_70_11
235	2025-03-11	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-17 13:44:39.666376	41_70_11
236	2025-03-11	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-17 13:44:39.666376	39_70_11
237	2025-03-11	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-17 13:44:39.666376	43_70_11
238	2025-03-12	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-17 14:06:36.021168	5_71_11
239	2025-03-12	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-17 14:06:36.021168	7_71_11
240	2025-03-12	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-17 14:06:36.021168	8_71_11
241	2025-03-12	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-17 14:06:36.021168	10_71_11
242	2025-03-12	診所	\N	安定	500	\N	診所	5386	\N	2025-03-17 14:06:36.021168	12_71_11
243	2025-03-12	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-17 14:06:36.021168	13_71_11
244	2025-03-12	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-17 14:06:36.021168	16_71_11
245	2025-03-12	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-17 14:06:36.021168	19_71_11
246	2025-03-12	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-17 14:06:36.021168	20_71_11
248	2025-03-12	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-17 14:06:36.021168	2_71_11
249	2025-03-12	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-17 14:06:36.021168	3_71_11
250	2025-03-12	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-17 14:06:36.021168	4_71_11
251	2025-03-12	永大路	\N	診所	280	\N	診所	533	\N	2025-03-17 14:06:36.021168	6_71_11
252	2025-03-12	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-17 14:06:36.021168	9_71_11
253	2025-03-12	安定	\N	診所	500	\N	診所	5386	\N	2025-03-17 14:06:36.021168	11_71_11
255	2025-03-12	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-17 14:06:36.021168	15_71_11
256	2025-03-12	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-17 14:06:36.021168	17_71_11
257	2025-03-12	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-17 14:06:36.021168	18_71_11
258	2025-03-12	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-17 14:06:36.021168	38_71_11
259	2025-03-12	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-17 14:06:36.021168	42_71_11
260	2025-03-12	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-17 14:06:36.021168	39_71_11
261	2025-03-12	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-17 14:06:36.021168	43_71_11
262	2025-03-12	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-17 14:06:36.021168	1_71_11
247	2025-03-12	診所	民德58	育德二路	110	\N	診所	28530	民德路請假	2025-03-17 14:06:36.021168	21_71_11
254	2025-03-12	育德二路	民德58	診所	90	\N	診所	61553	民德路請假	2025-03-17 14:06:36.021168	14_71_11
263	2025-03-13	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-17 14:15:57.759689	24_72_11
264	2025-03-13	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-17 14:15:57.759689	25_72_11
265	2025-03-13	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-17 14:15:57.759689	30_72_11
266	2025-03-13	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-17 14:15:57.759689	31_72_11
267	2025-03-13	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-17 14:15:57.759689	36_72_11
268	2025-03-13	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-17 14:15:57.759689	23_72_11
269	2025-03-13	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-17 14:15:57.759689	26_72_11
270	2025-03-13	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-17 14:15:57.759689	29_72_11
271	2025-03-13	信智	\N	診所	140	\N	診所	61553	\N	2025-03-17 14:15:57.759689	32_72_11
272	2025-03-13	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-17 14:15:57.759689	33_72_11
273	2025-03-13	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-17 14:15:57.759689	35_72_11
274	2025-03-13	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-17 14:15:57.759689	22_72_11
275	2025-03-13	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-17 14:15:57.759689	40_72_11
276	2025-03-13	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-17 14:15:57.759689	41_72_11
277	2025-03-13	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-17 14:15:57.759689	39_72_11
278	2025-03-13	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-17 14:15:57.759689	43_72_11
279	2025-03-14	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-17 14:26:17.98546	5_73_11
280	2025-03-14	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-17 14:26:17.98546	7_73_11
281	2025-03-14	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-17 14:26:17.98546	8_73_11
282	2025-03-14	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-17 14:26:17.98546	13_73_11
283	2025-03-14	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-17 14:26:17.98546	16_73_11
284	2025-03-14	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-17 14:26:17.98546	19_73_11
285	2025-03-14	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-17 14:26:17.98546	2_73_11
286	2025-03-14	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-17 14:26:17.98546	3_73_11
287	2025-03-14	永大路	\N	診所	280	\N	診所	533	\N	2025-03-17 14:26:17.98546	6_73_11
288	2025-03-14	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-17 14:26:17.98546	14_73_11
289	2025-03-14	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-17 14:26:17.98546	15_73_11
290	2025-03-14	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-17 14:26:17.98546	17_73_11
291	2025-03-14	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-17 14:26:17.98546	18_73_11
292	2025-03-14	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-17 14:26:17.98546	38_73_11
293	2025-03-14	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-17 14:26:17.98546	39_73_11
294	2025-03-14	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-17 14:26:17.98546	1_73_11
295	2025-03-14	診所	\N	安定	500	\N	診所	533	\N	2025-03-17 14:26:17.98546	12_73_11
296	2025-03-14	安定	\N	診所	500	\N	診所	533	\N	2025-03-17 14:26:17.98546	11_73_11
297	2025-03-14	東洋	新戶	久保田	360	\N	東洋	533	\N	2025-03-17 14:26:17.98546	43_73_11
298	2025-03-14	久保田	新戶	東洋	360	\N	東洋	61379	\N	2025-03-17 14:26:17.98546	42_73_11
299	2025-03-15	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-17 14:29:18.331017	30_74_11
300	2025-03-15	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-17 14:29:18.331017	31_74_11
301	2025-03-15	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-17 14:29:18.331017	36_74_11
302	2025-03-15	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-17 14:29:18.331017	23_74_11
303	2025-03-15	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-17 14:29:18.331017	29_74_11
304	2025-03-15	信智	\N	診所	140	\N	診所	61553	\N	2025-03-17 14:29:18.331017	32_74_11
305	2025-03-15	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-17 14:29:18.331017	33_74_11
306	2025-03-15	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-17 14:29:18.331017	35_74_11
307	2025-03-15	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-17 14:29:18.331017	22_74_11
308	2025-03-15	診所	文賢路	和緯四	0	\N	\N	\N	\N	2025-03-17 16:35:18.198595	C_308
309	2025-03-15	診所	文賢路	和緯四	0	-140	診所	533	上星期漏扣	2025-03-17 16:39:01.558741	C_309
310	2025-03-19	高鐵站	無	東洋	\N	\N	診所	533	\N	2025-03-20 00:06:42.591143	T_895
311	2025-03-17	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-20 09:31:36.120132	5_76_12
312	2025-03-17	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-20 09:31:36.120132	7_76_12
313	2025-03-17	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-20 09:31:36.120132	8_76_12
314	2025-03-17	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-20 09:31:36.120132	10_76_12
315	2025-03-17	診所	\N	安定	500	\N	診所	5386	\N	2025-03-20 09:31:36.120132	12_76_12
316	2025-03-17	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-20 09:31:36.120132	13_76_12
317	2025-03-17	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-20 09:31:36.120132	16_76_12
318	2025-03-17	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-20 09:31:36.120132	19_76_12
319	2025-03-17	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-20 09:31:36.120132	20_76_12
320	2025-03-17	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-20 09:31:36.120132	21_76_12
321	2025-03-17	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-20 09:31:36.120132	2_76_12
322	2025-03-17	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-20 09:31:36.120132	3_76_12
323	2025-03-17	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-20 09:31:36.120132	4_76_12
324	2025-03-17	永大路	\N	診所	280	\N	診所	533	\N	2025-03-20 09:31:36.120132	6_76_12
325	2025-03-17	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-20 09:31:36.120132	9_76_12
326	2025-03-17	安定	\N	診所	500	\N	診所	5386	\N	2025-03-20 09:31:36.120132	11_76_12
327	2025-03-17	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-20 09:31:36.120132	14_76_12
328	2025-03-17	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-20 09:31:36.120132	15_76_12
329	2025-03-17	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-20 09:31:36.120132	17_76_12
330	2025-03-17	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-20 09:31:36.120132	18_76_12
331	2025-03-17	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	38_76_12
332	2025-03-17	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	42_76_12
333	2025-03-17	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	39_76_12
334	2025-03-17	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	43_76_12
335	2025-03-17	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-20 09:31:36.120132	1_76_12
336	2025-03-18	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-20 09:31:36.120132	24_77_12
337	2025-03-18	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-20 09:31:36.120132	25_77_12
338	2025-03-18	診所	\N	灣裡路	340	\N	診所	5386	\N	2025-03-20 09:31:36.120132	28_77_12
339	2025-03-18	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-20 09:31:36.120132	30_77_12
340	2025-03-18	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-20 09:31:36.120132	31_77_12
341	2025-03-18	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-20 09:31:36.120132	36_77_12
342	2025-03-18	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-20 09:31:36.120132	23_77_12
343	2025-03-18	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-20 09:31:36.120132	26_77_12
344	2025-03-18	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-20 09:31:36.120132	27_77_12
345	2025-03-18	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-20 09:31:36.120132	29_77_12
346	2025-03-18	信智	\N	診所	140	\N	診所	61553	\N	2025-03-20 09:31:36.120132	32_77_12
347	2025-03-18	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-20 09:31:36.120132	33_77_12
348	2025-03-18	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-20 09:31:36.120132	35_77_12
349	2025-03-18	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-20 09:31:36.120132	22_77_12
350	2025-03-18	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	40_77_12
351	2025-03-18	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	41_77_12
352	2025-03-18	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	39_77_12
353	2025-03-18	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	43_77_12
354	2025-03-19	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-20 09:31:36.120132	5_78_12
355	2025-03-19	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-20 09:31:36.120132	7_78_12
356	2025-03-19	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-20 09:31:36.120132	8_78_12
357	2025-03-19	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-20 09:31:36.120132	10_78_12
358	2025-03-19	診所	\N	安定	500	\N	診所	5386	\N	2025-03-20 09:31:36.120132	12_78_12
359	2025-03-19	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-20 09:31:36.120132	13_78_12
360	2025-03-19	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-20 09:31:36.120132	16_78_12
361	2025-03-19	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-20 09:31:36.120132	19_78_12
362	2025-03-19	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-20 09:31:36.120132	20_78_12
363	2025-03-19	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-20 09:31:36.120132	21_78_12
364	2025-03-19	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-20 09:31:36.120132	2_78_12
365	2025-03-19	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-20 09:31:36.120132	3_78_12
366	2025-03-19	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-20 09:31:36.120132	4_78_12
367	2025-03-19	永大路	\N	診所	280	\N	診所	533	\N	2025-03-20 09:31:36.120132	6_78_12
368	2025-03-19	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-20 09:31:36.120132	9_78_12
369	2025-03-19	安定	\N	診所	500	\N	診所	5386	\N	2025-03-20 09:31:36.120132	11_78_12
370	2025-03-19	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-20 09:31:36.120132	14_78_12
371	2025-03-19	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-20 09:31:36.120132	15_78_12
372	2025-03-19	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-20 09:31:36.120132	17_78_12
373	2025-03-19	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-20 09:31:36.120132	18_78_12
374	2025-03-19	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	38_78_12
375	2025-03-19	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	42_78_12
376	2025-03-19	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	39_78_12
377	2025-03-19	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	43_78_12
378	2025-03-19	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-20 09:31:36.120132	1_78_12
379	2025-03-20	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-20 09:31:36.120132	23_79_12
380	2025-03-20	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-20 09:31:36.120132	27_79_12
381	2025-03-20	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-20 09:31:36.120132	22_79_12
382	2025-03-20	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-20 09:31:36.120132	40_79_12
383	2025-03-20	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-20 09:31:36.120132	41_79_12
384	2025-03-20	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-20 13:50:55.336347	24_79_12
385	2025-03-20	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-20 13:50:55.336347	25_79_12
386	2025-03-20	診所	\N	灣裡路	340	\N	診所	5386	\N	2025-03-20 13:50:55.336347	28_79_12
387	2025-03-20	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-20 13:50:55.336347	26_79_12
388	2025-03-20	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-20 13:50:55.336347	29_79_12
389	2025-03-20	信智	\N	診所	140	\N	診所	61553	\N	2025-03-20 13:50:55.336347	32_79_12
390	2025-03-20	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-20 13:50:55.336347	33_79_12
391	2025-03-20	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-20 13:50:55.336347	35_79_12
392	2025-03-20	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-20 21:08:57.810234	39_79_12
393	2025-03-20	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-20 21:08:57.810234	43_79_12
394	2025-03-21	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-21 12:06:09.992692	5_80_12
395	2025-03-21	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-21 12:06:09.992692	13_80_12
396	2025-03-21	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-21 12:06:09.992692	19_80_12
397	2025-03-21	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-21 12:06:09.992692	2_80_12
398	2025-03-21	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-21 12:06:09.992692	3_80_12
399	2025-03-21	永大路	\N	診所	280	\N	診所	533	\N	2025-03-21 12:06:09.992692	6_80_12
400	2025-03-21	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-21 12:06:09.992692	9_80_12
401	2025-03-21	安定	\N	診所	500	\N	診所	5386	\N	2025-03-21 12:06:09.992692	11_80_12
402	2025-03-21	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-21 12:06:09.992692	17_80_12
403	2025-03-21	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-21 12:06:09.992692	18_80_12
404	2025-03-21	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-21 12:06:09.992692	38_80_12
405	2025-03-21	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-21 12:06:09.992692	42_80_12
406	2025-03-21	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-21 12:06:09.992692	1_80_12
407	2025-03-21	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-21 12:10:45.038555	7_80_12
408	2025-03-21	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-21 21:21:34.924198	8_80_12
409	2025-03-21	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-21 21:21:34.924198	10_80_12
410	2025-03-21	診所	\N	安定	500	\N	診所	5386	\N	2025-03-21 21:21:34.924198	12_80_12
411	2025-03-21	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-21 21:21:34.924198	16_80_12
412	2025-03-21	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-21 21:21:34.924198	20_80_12
413	2025-03-21	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-21 21:21:34.924198	21_80_12
414	2025-03-21	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-21 21:21:34.924198	4_80_12
415	2025-03-21	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-21 21:21:34.924198	14_80_12
416	2025-03-21	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-21 21:21:34.924198	15_80_12
417	2025-03-21	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-21 21:21:34.924198	43_80_12
418	2025-03-22	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-22 07:39:03.550431	23_81_12
419	2025-03-22	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-22 07:39:03.550431	27_81_12
\.


--
-- Data for Name: customers; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.customers (id, name, address, short_name, category, remarks) FROM stdin;
1	東洋先端科技	台南市安南區工業三路50號	東洋	東洋	\N
2	謝智超達恩診所	台南市中西區西門路二段375號3樓	診所	診所	\N
3	台南高鐵站	台南市歸仁區歸仁大道	高鐵站	東洋	\N
4	林明煌	台南市南區文南路71號	文南71	東洋	\N
5	胡昌吉	台南市永康區大灣二街	大灣二街	診所	\N
6	中華北路	台南市北區台南市北區中華北路一段105巷	中華北路	診所	\N
7	和緯路二段	台南市北區和緯路二段152號	和緯152	診所	\N
8	北門路二段	台南市北區北門路二段527巷口	北門二段	診所	\N
9	小北路	台南市北區小北路16號	小北路	診所	\N
10	民德路	台南市北區民德路105巷	民德105	診所	\N
11	永大路三段	台南市永康區永大路三段	永大路	診所	\N
12	中華南路	台南市南區中華南路二段	中華南路	診所	\N
13	新建路	台南市南區新建路	新建路	診所	\N
15	俊文	台南市中西區府前二街48號	府前二街	診所	\N
16	育德二路	台南市北區育德二路	育德二路	診所	\N
17	民德路58	台南市北區民德路58巷	民德58	診所	\N
18	怡平路	台南市安平區怡平路	怡平路	診所	\N
19	忠孝街	台南市中西區忠孝街	忠孝街	診所	\N
20	安北路	台南市安平區安北路	安北路	診所	\N
21	古堡街	台南市安平區古堡街	古堡街	診所	\N
22	和緯路五段	台南市安平區和緯路五段	和緯五	診所	\N
23	公園南路	台南市北區公園南路	公園南路	診所	\N
24	海安路二段	台南市中西區海安路二段	海安路	診所	\N
25	金華路二段	台南市南區金華路二段283號	金華路	診所	\N
26	灣裡馬鎮宮	台南市南區灣裡路	馬鎮宮	診所	\N
27	灣裡路	台南市南區灣裡路448巷	灣裡路	診所	\N
28	和緯路四段	台南市北區和緯路四段105巷	和緯四	診所	\N
29	文賢路	台南市北區文賢路	文賢路	診所	\N
30	信智	台南市北區北門路三段	信智	診所	\N
31	南寧街	台南市中西區南寧街	南寧街	診所	\N
32	仁和路	台南市東區仁和路111巷24號	仁和路	診所	\N
33	錦霞	台南市安定區安定里	安定	診所	\N
34	長溪路一段	台南市安南區長溪路一段	長溪路	診所	\N
35	同安路	台南市安南區同安路	同安路	診所	\N
36	二井	高雄市前鎮區中山二路198號	二井	東洋	\N
37	久保田	台南市北區公園南路站前CASA	久保田	東洋	\N
38	新戶	台南市北區公園南路站前CASA	新戶	東洋	\N
14	健康三街	台南市安平區健康三街12巷	健康三街	診所	\N
\.


--
-- Data for Name: drivers; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.drivers (id, name, plate_number, car_brand, car_model) FROM stdin;
5386	崔林彥	TDE-5386	Toyota	RAV4
28530	涂文峰	留空後補	Toyota	RAV4
533	黃清池	留空後補	Toyota	Camry
61553	蘇木山	留空後補	Toyota	Camry
61367	王華南	留空後補	Toyota	Cross
61379	黃榮章	留空後補	Toyota	Camry
\.


--
-- Data for Name: fixed_schedules; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.fixed_schedules (id, route_number, departure_time, start_point, via_point, end_point, base_fare, surcharge, category, driver_id, direction) FROM stdin;
5	135	10:40:00	診所	\N	大灣二街	275	\N	診所	533	回
7	135	12:10:00	診所	\N	中華北路	135	\N	診所	533	回
8	135	12:35:00	診所	\N	和緯152	105	\N	診所	533	回
10	135	14:40:00	診所	\N	仁和路	220	\N	診所	533	回
12	135	15:00:00	診所	\N	安定	500	\N	診所	5386	回
13	135	09:50:00	診所	\N	長溪路	210	\N	診所	61553	回
16	135	15:15:00	診所	\N	永大路	280	\N	診所	61553	回
19	135	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	回
20	135	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	回
21	135	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	回
24	246	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	回
25	246	10:50:00	診所	\N	忠孝街	85	\N	診所	533	回
28	246	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	回
30	246	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	回
31	246	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	回
36	246	15:15:00	診所	\N	南寧街	120	\N	診所	533	回
2	135	07:30:00	中華北路	\N	診所	135	\N	診所	533	來
3	135	08:00:00	和緯152	\N	診所	105	\N	診所	533	來
4	135	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	來
6	135	11:30:00	永大路	\N	診所	280	\N	診所	533	來
9	135	09:50:00	仁和路	\N	診所	220	\N	診所	533	來
11	135	10:00:00	安定	\N	診所	500	\N	診所	5386	來
14	135	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	來
15	135	14:50:00	同安路	\N	診所	220	\N	診所	61553	來
17	135	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	來
18	135	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	來
23	246	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	來
26	246	10:20:00	公園南路	海安路	診所	90	\N	診所	533	來
27	246	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	來
29	246	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	來
32	246	10:30:00	信智	\N	診所	140	\N	診所	61553	來
33	246	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	來
35	246	11:10:00	南寧街	\N	診所	120	\N	診所	61553	來
22	246	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	來
38	135	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	來
40	24	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	來
41	24	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	來
42	135	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	來
39	12345	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	回
43	12345	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	回
1	135	05:20:00	大灣二街	\N	診所	275	\N	診所	533	來
\.


--
-- Data for Name: persons; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.persons (id, name, contact, email, role, remarks) FROM stdin;
\.


--
-- Data for Name: trips; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.trips (trip_id, fixed_trip_id, week_number, date, "time", start_point, via_point, end_point, meter_fare, extra_fare, category, driver_id, status, unique_code) FROM stdin;
1006	1	12	2025-03-21	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_80_12
896	5	12	2025-03-17	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_76_12
897	7	12	2025-03-17	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_76_12
898	8	12	2025-03-17	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_76_12
899	10	12	2025-03-17	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_76_12
900	12	12	2025-03-17	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_76_12
901	13	12	2025-03-17	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_76_12
902	16	12	2025-03-17	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_76_12
903	19	12	2025-03-17	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_76_12
904	20	12	2025-03-17	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_76_12
905	21	12	2025-03-17	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_76_12
906	2	12	2025-03-17	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_76_12
907	3	12	2025-03-17	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_76_12
908	4	12	2025-03-17	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_76_12
909	6	12	2025-03-17	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_76_12
910	9	12	2025-03-17	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_76_12
911	11	12	2025-03-17	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_76_12
912	14	12	2025-03-17	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_76_12
913	15	12	2025-03-17	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_76_12
914	17	12	2025-03-17	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_76_12
915	18	12	2025-03-17	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_76_12
916	38	12	2025-03-17	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_76_12
917	42	12	2025-03-17	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_76_12
968	31	12	2025-03-20	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	完成	31_79_12
967	30	12	2025-03-20	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	完成	30_79_12
980	39	12	2025-03-20	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_79_12
981	43	12	2025-03-20	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_79_12
969	36	12	2025-03-20	15:15:00	診所	\N	南寧街	120	\N	診所	533	衝突	36_79_12
1004	39	12	2025-03-21	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	取消	39_80_12
982	5	12	2025-03-21	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_80_12
987	13	12	2025-03-21	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_80_12
989	19	12	2025-03-21	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_80_12
992	2	12	2025-03-21	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_80_12
993	3	12	2025-03-21	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_80_12
995	6	12	2025-03-21	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_80_12
996	9	12	2025-03-21	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_80_12
997	11	12	2025-03-21	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_80_12
1000	17	12	2025-03-21	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_80_12
1001	18	12	2025-03-21	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_80_12
1002	38	12	2025-03-21	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_80_12
1003	42	12	2025-03-21	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_80_12
983	7	12	2025-03-21	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_80_12
984	8	12	2025-03-21	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_80_12
985	10	12	2025-03-21	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_80_12
986	12	12	2025-03-21	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_80_12
988	16	12	2025-03-21	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_80_12
990	20	12	2025-03-21	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_80_12
991	21	12	2025-03-21	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_80_12
994	4	12	2025-03-21	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_80_12
998	14	12	2025-03-21	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_80_12
999	15	12	2025-03-21	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_80_12
1005	43	12	2025-03-21	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_80_12
1013	23	12	2025-03-22	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_81_12
964	24	12	2025-03-20	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_79_12
965	25	12	2025-03-20	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_79_12
966	28	12	2025-03-20	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_79_12
971	26	12	2025-03-20	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_79_12
973	29	12	2025-03-20	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_79_12
974	32	12	2025-03-20	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_79_12
975	33	12	2025-03-20	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_79_12
976	35	12	2025-03-20	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_79_12
1007	24	12	2025-03-22	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	準備	24_81_12
1008	25	12	2025-03-22	10:50:00	診所	\N	忠孝街	85	\N	診所	533	準備	25_81_12
1009	28	12	2025-03-22	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	準備	28_81_12
1010	30	12	2025-03-22	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	準備	30_81_12
1011	31	12	2025-03-22	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	準備	31_81_12
1012	36	12	2025-03-22	15:15:00	診所	\N	南寧街	120	\N	診所	533	準備	36_81_12
1016	29	12	2025-03-22	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	準備	29_81_12
1017	32	12	2025-03-22	10:30:00	信智	\N	診所	140	\N	診所	61553	準備	32_81_12
1018	33	12	2025-03-22	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	準備	33_81_12
1019	35	12	2025-03-22	11:10:00	南寧街	\N	診所	120	\N	診所	61553	準備	35_81_12
918	39	12	2025-03-17	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_76_12
919	43	12	2025-03-17	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_76_12
920	1	12	2025-03-17	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_76_12
921	24	12	2025-03-18	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_77_12
922	25	12	2025-03-18	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_77_12
923	28	12	2025-03-18	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_77_12
924	30	12	2025-03-18	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_77_12
925	31	12	2025-03-18	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_77_12
926	36	12	2025-03-18	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_77_12
927	23	12	2025-03-18	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_77_12
928	26	12	2025-03-18	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_77_12
929	27	12	2025-03-18	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_77_12
930	29	12	2025-03-18	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_77_12
931	32	12	2025-03-18	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_77_12
932	33	12	2025-03-18	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_77_12
933	35	12	2025-03-18	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_77_12
934	22	12	2025-03-18	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_77_12
935	40	12	2025-03-18	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_77_12
936	41	12	2025-03-18	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_77_12
937	39	12	2025-03-18	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_77_12
938	43	12	2025-03-18	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_77_12
939	5	12	2025-03-19	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_78_12
940	7	12	2025-03-19	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_78_12
941	8	12	2025-03-19	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_78_12
942	10	12	2025-03-19	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_78_12
943	12	12	2025-03-19	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_78_12
944	13	12	2025-03-19	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_78_12
945	16	12	2025-03-19	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_78_12
946	19	12	2025-03-19	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_78_12
947	20	12	2025-03-19	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_78_12
948	21	12	2025-03-19	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_78_12
949	2	12	2025-03-19	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_78_12
950	3	12	2025-03-19	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_78_12
951	4	12	2025-03-19	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_78_12
952	6	12	2025-03-19	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_78_12
953	9	12	2025-03-19	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_78_12
954	11	12	2025-03-19	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_78_12
955	14	12	2025-03-19	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_78_12
956	15	12	2025-03-19	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_78_12
957	17	12	2025-03-19	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_78_12
958	18	12	2025-03-19	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_78_12
959	38	12	2025-03-19	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_78_12
960	42	12	2025-03-19	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_78_12
961	39	12	2025-03-19	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_78_12
962	43	12	2025-03-19	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_78_12
963	1	12	2025-03-19	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_78_12
970	23	12	2025-03-20	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_79_12
972	27	12	2025-03-20	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_79_12
977	22	12	2025-03-20	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_79_12
978	40	12	2025-03-20	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_79_12
1015	27	12	2025-03-22	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_81_12
1014	26	12	2025-03-22	10:20:00	公園南路	海安路	診所	90	\N	診所	533	取消	26_81_12
1020	22	12	2025-03-22	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	準備	22_81_12
979	41	12	2025-03-20	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_79_12
\.


--
-- Name: completed_trips_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.completed_trips_id_seq', 419, true);


--
-- Name: customers_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.customers_id_seq', 1, false);


--
-- Name: persons_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.persons_id_seq', 1, false);


--
-- Name: trips_trip_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.trips_trip_id_seq', 1020, true);


--
-- Name: completed_trips completed_trips_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_pkey PRIMARY KEY (id);


--
-- Name: customers customers_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.customers
    ADD CONSTRAINT customers_pkey PRIMARY KEY (id);


--
-- Name: customers customers_short_name_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.customers
    ADD CONSTRAINT customers_short_name_key UNIQUE (short_name);


--
-- Name: drivers drivers_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.drivers
    ADD CONSTRAINT drivers_pkey PRIMARY KEY (id);


--
-- Name: fixed_schedules fixed_schedules_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.fixed_schedules
    ADD CONSTRAINT fixed_schedules_pkey PRIMARY KEY (id);


--
-- Name: persons persons_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.persons
    ADD CONSTRAINT persons_pkey PRIMARY KEY (id);


--
-- Name: trips trips_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_pkey PRIMARY KEY (trip_id);


--
-- Name: idx_completed_trips_date; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_completed_trips_date ON public.completed_trips USING btree (date);


--
-- Name: idx_completed_trips_driver; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_completed_trips_driver ON public.completed_trips USING btree (driver_id);


--
-- Name: idx_trips_date; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_trips_date ON public.trips USING btree (date);


--
-- Name: idx_trips_driver; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_trips_driver ON public.trips USING btree (driver_id);


--
-- Name: idx_trips_status; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_trips_status ON public.trips USING btree (status);


--
-- Name: customers trigger_set_customer_id; Type: TRIGGER; Schema: public; Owner: postgres
--

CREATE TRIGGER trigger_set_customer_id BEFORE INSERT ON public.customers FOR EACH ROW EXECUTE FUNCTION public.set_customer_id();


--
-- Name: drivers trigger_set_driver_id; Type: TRIGGER; Schema: public; Owner: postgres
--

CREATE TRIGGER trigger_set_driver_id BEFORE INSERT ON public.drivers FOR EACH ROW EXECUTE FUNCTION public.set_driver_id();


--
-- Name: fixed_schedules trigger_set_schedule_id; Type: TRIGGER; Schema: public; Owner: postgres
--

CREATE TRIGGER trigger_set_schedule_id BEFORE INSERT ON public.fixed_schedules FOR EACH ROW EXECUTE FUNCTION public.set_schedule_id();


--
-- Name: completed_trips completed_trips_driver_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_driver_id_fkey FOREIGN KEY (driver_id) REFERENCES public.drivers(id);


--
-- Name: completed_trips completed_trips_end_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_end_point_fkey FOREIGN KEY (end_point) REFERENCES public.customers(short_name);


--
-- Name: completed_trips completed_trips_start_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_start_point_fkey FOREIGN KEY (start_point) REFERENCES public.customers(short_name);


--
-- Name: trips trips_driver_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_driver_id_fkey FOREIGN KEY (driver_id) REFERENCES public.drivers(id);


--
-- Name: trips trips_end_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_end_point_fkey FOREIGN KEY (end_point) REFERENCES public.customers(short_name);


--
-- Name: trips trips_fixed_trip_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_fixed_trip_id_fkey FOREIGN KEY (fixed_trip_id) REFERENCES public.fixed_schedules(id);


--
-- Name: trips trips_start_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_start_point_fkey FOREIGN KEY (start_point) REFERENCES public.customers(short_name);


--
-- PostgreSQL database dump complete
--

