--
-- PostgreSQL database cluster dump
--

SET default_transaction_read_only = off;

SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;

--
-- Roles
--

CREATE ROLE linyancui;
ALTER ROLE linyancui WITH SUPERUSER INHERIT CREATEROLE CREATEDB LOGIN REPLICATION BYPASSRLS;
CREATE ROLE postgres;
ALTER ROLE postgres WITH SUPERUSER INHERIT NOCREATEROLE NOCREATEDB LOGIN NOREPLICATION NOBYPASSRLS PASSWORD 'SCRAM-SHA-256$4096:Ny4fO7dvE9HSAWC+6THSFQ==$cSkxXAwpzXLW+5sOzw0hrBn0/c2lHUXeusBHWqjxQL0=:000VVNi1XIqvIuQTmTwZM4GmUU1L5Ot9w3c5RYeX/Ng=';






--
-- Databases
--

--
-- Database "template1" dump
--

\connect template1

--
-- PostgreSQL database dump
--

-- Dumped from database version 14.17 (Homebrew)
-- Dumped by pg_dump version 14.17 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- PostgreSQL database dump complete
--

--
-- Database "dispatch_db" dump
--

--
-- PostgreSQL database dump
--

-- Dumped from database version 14.17 (Homebrew)
-- Dumped by pg_dump version 14.17 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: dispatch_db; Type: DATABASE; Schema: -; Owner: postgres
--

CREATE DATABASE dispatch_db WITH TEMPLATE = template0 ENCODING = 'UTF8' LOCALE = 'C';


ALTER DATABASE dispatch_db OWNER TO postgres;

\connect dispatch_db

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: get_next_available_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.get_next_available_id() RETURNS integer
    LANGUAGE plpgsql
    AS $$
DECLARE
    next_id INTEGER;
BEGIN
    SELECT MIN(t1.id + 1) INTO next_id
    FROM drivers t1
    WHERE NOT EXISTS (
        SELECT 1 
        FROM drivers t2 
        WHERE t2.id = t1.id + 1
    );
    
    IF next_id IS NULL THEN
        SELECT COALESCE(MAX(id) + 1, 1) INTO next_id
        FROM drivers;
    END IF;
    
    RETURN next_id;
END;
$$;


ALTER FUNCTION public.get_next_available_id() OWNER TO postgres;

--
-- Name: set_customer_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.set_customer_id() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
BEGIN
    IF NEW.id IS NULL THEN
        NEW.id = get_next_available_id();
    END IF;
    RETURN NEW;
END;
$$;


ALTER FUNCTION public.set_customer_id() OWNER TO postgres;

--
-- Name: set_driver_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.set_driver_id() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
BEGIN
    IF NEW.id IS NULL THEN
        NEW.id = get_next_available_id();
    END IF;
    RETURN NEW;
END;
$$;


ALTER FUNCTION public.set_driver_id() OWNER TO postgres;

--
-- Name: set_schedule_id(); Type: FUNCTION; Schema: public; Owner: postgres
--

CREATE FUNCTION public.set_schedule_id() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
BEGIN
    IF NEW.id IS NULL THEN
        NEW.id = get_next_available_id();
    END IF;
    RETURN NEW;
END;
$$;


ALTER FUNCTION public.set_schedule_id() OWNER TO postgres;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: completed_trips; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.completed_trips (
    id integer NOT NULL,
    date date NOT NULL,
    start_point character varying(100),
    via_point character varying(100),
    end_point character varying(100),
    meter_fare integer,
    extra_fare integer,
    actual_fare integer GENERATED ALWAYS AS (
CASE
    WHEN ((meter_fare IS NOT NULL) AND (extra_fare IS NOT NULL)) THEN (meter_fare + extra_fare)
    WHEN (meter_fare IS NOT NULL) THEN meter_fare
    ELSE NULL::integer
END) STORED,
    category character varying(50),
    driver_id integer,
    remarks text,
    created_at timestamp without time zone DEFAULT CURRENT_TIMESTAMP,
    unique_code character varying(30)
);


ALTER TABLE public.completed_trips OWNER TO postgres;

--
-- Name: completed_trips_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.completed_trips_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.completed_trips_id_seq OWNER TO postgres;

--
-- Name: completed_trips_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.completed_trips_id_seq OWNED BY public.completed_trips.id;


--
-- Name: customers; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.customers (
    id integer NOT NULL,
    name character varying(100) NOT NULL,
    address character varying(200) NOT NULL,
    short_name character varying(50),
    category character varying(50),
    remarks text
);


ALTER TABLE public.customers OWNER TO postgres;

--
-- Name: customers_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.customers_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.customers_id_seq OWNER TO postgres;

--
-- Name: drivers; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.drivers (
    id integer NOT NULL,
    name character varying(50) NOT NULL,
    plate_number character varying(20),
    car_brand character varying(50),
    car_model character varying(50)
);


ALTER TABLE public.drivers OWNER TO postgres;

--
-- Name: fixed_schedules; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.fixed_schedules (
    id integer NOT NULL,
    route_number character varying(10),
    departure_time time without time zone NOT NULL,
    start_point character varying(100),
    via_point character varying(100),
    end_point character varying(100),
    base_fare integer,
    surcharge integer,
    total_fare integer GENERATED ALWAYS AS (
CASE
    WHEN ((base_fare IS NOT NULL) AND (surcharge IS NOT NULL)) THEN (base_fare + surcharge)
    WHEN (base_fare IS NOT NULL) THEN base_fare
    ELSE NULL::integer
END) STORED,
    category character varying(50),
    driver_id character varying(10),
    direction character varying(1)
);


ALTER TABLE public.fixed_schedules OWNER TO postgres;

--
-- Name: persons; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.persons (
    id integer NOT NULL,
    name character varying(100) NOT NULL,
    contact character varying(100),
    email character varying(200),
    role character varying(50),
    remarks text
);


ALTER TABLE public.persons OWNER TO postgres;

--
-- Name: persons_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.persons_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.persons_id_seq OWNER TO postgres;

--
-- Name: persons_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.persons_id_seq OWNED BY public.persons.id;


--
-- Name: trips; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.trips (
    trip_id integer NOT NULL,
    fixed_trip_id integer,
    week_number integer,
    date date,
    "time" time without time zone,
    start_point character varying(100),
    via_point character varying(100),
    end_point character varying(100),
    meter_fare integer,
    extra_fare integer,
    actual_fare integer GENERATED ALWAYS AS (
CASE
    WHEN ((meter_fare IS NOT NULL) AND (extra_fare IS NOT NULL)) THEN (meter_fare + extra_fare)
    WHEN (meter_fare IS NOT NULL) THEN meter_fare
    ELSE NULL::integer
END) STORED,
    category character varying(50),
    driver_id integer,
    status character varying(20),
    unique_code character varying(30)
);


ALTER TABLE public.trips OWNER TO postgres;

--
-- Name: trips_trip_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.trips_trip_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.trips_trip_id_seq OWNER TO postgres;

--
-- Name: trips_trip_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.trips_trip_id_seq OWNED BY public.trips.trip_id;


--
-- Name: completed_trips id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips ALTER COLUMN id SET DEFAULT nextval('public.completed_trips_id_seq'::regclass);


--
-- Name: persons id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.persons ALTER COLUMN id SET DEFAULT nextval('public.persons_id_seq'::regclass);


--
-- Name: trips trip_id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips ALTER COLUMN trip_id SET DEFAULT nextval('public.trips_trip_id_seq'::regclass);


--
-- Data for Name: completed_trips; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.completed_trips (id, date, start_point, via_point, end_point, meter_fare, extra_fare, category, driver_id, remarks, created_at, unique_code) FROM stdin;
435	2025-03-24	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-24 12:15:00.030664	7_83_13
438	2025-03-24	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-24 12:40:00.012781	8_83_13
480	2025-03-24	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-24 14:30:52.256271	14_83_13
483	2025-03-24	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-24 14:55:00.016862	15_83_13
523	2025-03-24	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-24 15:05:00.026112	21_83_13
528	2025-03-24	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-24 15:30:00.019165	4_83_13
558	2025-03-24	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-24 20:51:06.519934	39_83_13
559	2025-03-24	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-24 20:51:06.519934	43_83_13
603	2025-03-25	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-25 15:47:44.090006	24_84_13
604	2025-03-25	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-25 15:47:44.090006	25_84_13
605	2025-03-25	診所	\N	灣裡路	340	\N	診所	5386	\N	2025-03-25 15:47:44.090006	28_84_13
606	2025-03-25	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-25 15:47:44.090006	31_84_13
607	2025-03-25	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-25 15:47:44.090006	36_84_13
608	2025-03-25	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-25 15:47:44.090006	23_84_13
609	2025-03-25	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-25 15:47:44.090006	26_84_13
610	2025-03-25	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-25 15:47:44.090006	27_84_13
611	2025-03-25	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-25 15:47:44.090006	29_84_13
612	2025-03-25	信智	\N	診所	140	\N	診所	61553	\N	2025-03-25 15:47:44.090006	32_84_13
613	2025-03-25	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-25 15:47:44.090006	33_84_13
614	2025-03-25	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-25 15:47:44.090006	35_84_13
615	2025-03-25	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-25 15:47:44.090006	22_84_13
616	2025-03-25	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-25 15:47:44.090006	40_84_13
617	2025-03-25	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-25 15:47:44.090006	41_84_13
619	2025-03-25	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-25 16:05:00.005525	30_84_13
621	2025-03-25	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-25 17:35:00.003719	39_84_13
624	2025-03-26	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-29 10:15:11.79561	5_85_13
625	2025-03-26	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-29 10:15:11.79561	7_85_13
626	2025-03-26	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-29 10:15:11.79561	8_85_13
627	2025-03-26	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-29 10:15:11.79561	10_85_13
628	2025-03-26	診所	\N	安定	500	\N	診所	5386	\N	2025-03-29 10:15:11.79561	12_85_13
629	2025-03-26	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-29 10:15:11.79561	13_85_13
630	2025-03-26	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-29 10:15:11.79561	16_85_13
631	2025-03-26	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-29 10:15:11.79561	19_85_13
632	2025-03-26	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-29 10:15:11.79561	20_85_13
633	2025-03-26	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-29 10:15:11.79561	21_85_13
634	2025-03-26	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-29 10:15:11.79561	2_85_13
635	2025-03-26	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-29 10:15:11.79561	3_85_13
636	2025-03-26	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-29 10:15:11.79561	4_85_13
637	2025-03-26	永大路	\N	診所	280	\N	診所	533	\N	2025-03-29 10:15:11.79561	6_85_13
638	2025-03-26	安定	\N	診所	500	\N	診所	5386	\N	2025-03-29 10:15:11.79561	11_85_13
639	2025-03-26	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-29 10:15:11.79561	14_85_13
640	2025-03-26	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-29 10:15:11.79561	15_85_13
641	2025-03-26	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-29 10:15:11.79561	17_85_13
642	2025-03-26	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-29 10:15:11.79561	18_85_13
643	2025-03-26	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-29 10:15:11.79561	38_85_13
644	2025-03-26	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-29 10:15:11.79561	42_85_13
645	2025-03-26	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-29 10:15:11.79561	39_85_13
646	2025-03-26	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-29 10:15:11.79561	43_85_13
647	2025-03-26	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-29 10:15:11.79561	1_85_13
648	2025-03-27	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-29 10:15:11.79561	24_86_13
649	2025-03-27	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-29 10:15:11.79561	25_86_13
650	2025-03-27	診所	\N	灣裡路	340	\N	診所	5386	\N	2025-03-29 10:15:11.79561	28_86_13
651	2025-03-27	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-29 10:15:11.79561	30_86_13
652	2025-03-27	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-29 10:15:11.79561	31_86_13
653	2025-03-27	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-29 10:15:11.79561	36_86_13
654	2025-03-27	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-29 10:15:11.79561	23_86_13
655	2025-03-27	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-29 10:15:11.79561	26_86_13
656	2025-03-27	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-29 10:15:11.79561	27_86_13
657	2025-03-27	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-29 10:15:11.79561	29_86_13
658	2025-03-27	信智	\N	診所	140	\N	診所	61553	\N	2025-03-29 10:15:11.79561	32_86_13
659	2025-03-27	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-29 10:15:11.79561	33_86_13
660	2025-03-27	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-29 10:15:11.79561	35_86_13
661	2025-03-27	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-29 10:15:11.79561	22_86_13
662	2025-03-27	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-29 10:15:11.79561	40_86_13
663	2025-03-27	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-29 10:15:11.79561	41_86_13
664	2025-03-27	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-29 10:15:11.79561	39_86_13
665	2025-03-27	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-29 10:15:11.79561	43_86_13
666	2025-03-28	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-29 10:15:11.79561	5_87_13
667	2025-03-28	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-29 10:15:11.79561	7_87_13
668	2025-03-28	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-29 10:15:11.79561	8_87_13
669	2025-03-28	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-29 10:15:11.79561	10_87_13
670	2025-03-28	診所	\N	安定	500	\N	診所	5386	\N	2025-03-29 10:15:11.79561	12_87_13
436	2025-03-24	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-24 12:15:00.032635	7_83_13
437	2025-03-24	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-24 12:40:00.012782	8_83_13
481	2025-03-24	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-24 14:45:00.036608	10_83_13
482	2025-03-24	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-24 14:55:00.016862	15_83_13
524	2025-03-24	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-24 15:05:00.026128	21_83_13
527	2025-03-24	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-24 15:30:00.019167	4_83_13
562	2025-03-21	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-24 23:01:48.006936	13_80_12
564	2025-03-21	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-24 23:01:48.006936	38_80_12
565	2025-03-21	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-24 23:01:48.006936	40_80_12
566	2025-03-21	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-24 23:01:48.006936	41_80_12
567	2025-03-21	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-24 23:01:48.006936	42_80_12
568	2025-03-21	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-24 23:01:48.006936	39_80_12
569	2025-03-21	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-24 23:01:48.006936	43_80_12
570	2025-03-21	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-24 23:01:48.006936	1_80_12
571	2025-03-21	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-24 23:01:48.006936	5_80_12
574	2025-03-21	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-24 23:01:48.006936	16_80_12
576	2025-03-21	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-24 23:01:48.006936	20_80_12
577	2025-03-21	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-24 23:01:48.006936	21_80_12
581	2025-03-21	永大路	\N	診所	280	\N	診所	533	\N	2025-03-24 23:01:48.006936	6_80_12
584	2025-03-21	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-24 23:01:48.006936	14_80_12
585	2025-03-21	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-24 23:01:48.006936	15_80_12
586	2025-03-21	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-24 23:01:48.006936	17_80_12
561	2025-03-21	診所	\N	安定	500	\N	診所	533	\N	2025-03-24 23:01:48.006936	12_80_12
583	2025-03-21	安定	\N	診所	500	\N	診所	533	\N	2025-03-24 23:01:48.006936	11_80_12
699	2025-03-29	診所	\N	灣裡路	340	\N	診所	5386	\N	2025-03-29 11:01:19.740263	28_88_13
701	2025-03-29	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-29 14:08:58.812589	29_88_13
703	2025-03-29	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-29 15:54:57.84499	31_88_13
573	2025-03-21	診所	和緯152	中華北路	200	\N	診所	533	\N	2025-03-24 23:01:48.006936	8_80_12
572	2025-03-21	中華北路	和緯152	診所	200	\N	診所	533	\N	2025-03-24 23:01:48.006936	7_80_12
618	2025-03-25	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-25 16:05:00.003565	30_84_13
620	2025-03-25	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-25 17:35:00.003921	39_84_13
671	2025-03-28	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-29 10:15:11.79561	13_87_13
672	2025-03-28	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-29 10:15:11.79561	16_87_13
673	2025-03-28	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-29 10:15:11.79561	19_87_13
674	2025-03-28	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-29 10:15:11.79561	20_87_13
675	2025-03-28	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-29 10:15:11.79561	21_87_13
676	2025-03-28	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-29 10:15:11.79561	2_87_13
677	2025-03-28	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-29 10:15:11.79561	3_87_13
678	2025-03-28	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-29 10:15:11.79561	4_87_13
679	2025-03-28	永大路	\N	診所	280	\N	診所	533	\N	2025-03-29 10:15:11.79561	6_87_13
680	2025-03-28	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-29 10:15:11.79561	9_87_13
681	2025-03-28	安定	\N	診所	500	\N	診所	5386	\N	2025-03-29 10:15:11.79561	11_87_13
682	2025-03-28	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-29 10:15:11.79561	14_87_13
683	2025-03-28	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-29 10:15:11.79561	15_87_13
684	2025-03-28	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-29 10:15:11.79561	17_87_13
685	2025-03-28	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-29 10:15:11.79561	18_87_13
686	2025-03-28	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-29 10:15:11.79561	38_87_13
687	2025-03-28	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-29 10:15:11.79561	42_87_13
688	2025-03-28	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-29 10:15:11.79561	39_87_13
689	2025-03-28	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-29 10:15:11.79561	43_87_13
690	2025-03-28	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-29 10:15:11.79561	1_87_13
691	2025-03-29	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-29 10:15:11.79561	23_88_13
692	2025-03-29	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-29 10:15:11.79561	27_88_13
693	2025-03-29	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-29 10:15:11.79561	22_88_13
695	2025-03-29	信智	\N	診所	140	\N	診所	61553	\N	2025-03-29 10:35:00.012766	32_88_13
698	2025-03-29	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-29 11:01:19.740263	24_88_13
439	2025-03-17	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-24 13:28:51.259354	5_76_12
440	2025-03-17	診所	\N	中華北路	135	\N	診所	533	\N	2025-03-24 13:28:51.259354	7_76_12
441	2025-03-17	診所	\N	和緯152	105	\N	診所	533	\N	2025-03-24 13:28:51.259354	8_76_12
442	2025-03-17	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-24 13:28:51.259354	10_76_12
443	2025-03-17	診所	\N	安定	500	\N	診所	5386	\N	2025-03-24 13:28:51.259354	12_76_12
444	2025-03-17	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-24 13:28:51.259354	13_76_12
445	2025-03-17	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-24 13:28:51.259354	16_76_12
447	2025-03-17	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-24 13:28:51.259354	20_76_12
448	2025-03-17	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-24 13:28:51.259354	21_76_12
449	2025-03-17	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-24 13:28:51.259354	2_76_12
450	2025-03-17	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-24 13:28:51.259354	3_76_12
451	2025-03-17	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-24 13:28:51.259354	4_76_12
452	2025-03-17	永大路	\N	診所	280	\N	診所	533	\N	2025-03-24 13:28:51.259354	6_76_12
453	2025-03-17	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-24 13:28:51.259354	9_76_12
454	2025-03-17	安定	\N	診所	500	\N	診所	5386	\N	2025-03-24 13:28:51.259354	11_76_12
455	2025-03-17	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-24 13:28:51.259354	14_76_12
456	2025-03-17	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-24 13:28:51.259354	15_76_12
457	2025-03-17	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-24 13:28:51.259354	17_76_12
459	2025-03-17	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-24 13:28:51.259354	38_76_12
460	2025-03-17	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-24 13:28:51.259354	40_76_12
461	2025-03-17	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-24 13:28:51.259354	41_76_12
462	2025-03-17	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-24 13:28:51.259354	42_76_12
463	2025-03-17	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-24 13:28:51.259354	39_76_12
464	2025-03-17	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-24 13:28:51.259354	43_76_12
465	2025-03-17	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-24 13:28:51.259354	1_76_12
458	2025-03-21	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-24 13:28:51.259354	18_76_12
446	2025-03-21	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-24 13:28:51.259354	19_76_12
484	2025-03-19	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-24 14:58:39.579674	5_78_12
487	2025-03-19	診所	\N	仁和路	220	\N	診所	533	\N	2025-03-24 14:58:39.579674	10_78_12
488	2025-03-19	診所	\N	安定	500	\N	診所	5386	\N	2025-03-24 14:58:39.579674	12_78_12
489	2025-03-19	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-24 14:58:39.579674	13_78_12
490	2025-03-19	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-24 14:58:39.579674	16_78_12
491	2025-03-19	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-24 14:58:39.579674	19_78_12
492	2025-03-19	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-24 14:58:39.579674	20_78_12
493	2025-03-19	診所	民德58	育德二路	110	\N	診所	28530	\N	2025-03-24 14:58:39.579674	21_78_12
496	2025-03-19	北門二段	小北路+民德105	診所	165	\N	診所	533	\N	2025-03-24 14:58:39.579674	4_78_12
497	2025-03-19	永大路	\N	診所	280	\N	診所	533	\N	2025-03-24 14:58:39.579674	6_78_12
498	2025-03-19	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-24 14:58:39.579674	9_78_12
499	2025-03-19	安定	\N	診所	500	\N	診所	5386	\N	2025-03-24 14:58:39.579674	11_78_12
500	2025-03-19	育德二路	民德58	診所	90	\N	診所	61553	\N	2025-03-24 14:58:39.579674	14_78_12
501	2025-03-19	同安路	\N	診所	220	\N	診所	61553	\N	2025-03-24 14:58:39.579674	15_78_12
502	2025-03-19	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-24 14:58:39.579674	17_78_12
503	2025-03-19	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-24 14:58:39.579674	18_78_12
504	2025-03-19	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-24 14:58:39.579674	38_78_12
505	2025-03-19	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-24 14:58:39.579674	42_78_12
506	2025-03-19	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-24 14:58:39.579674	1_78_12
507	2025-03-20	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-24 14:58:39.579674	24_79_12
508	2025-03-20	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-24 14:58:39.579674	25_79_12
509	2025-03-20	診所	\N	灣裡路	340	\N	診所	5386	\N	2025-03-24 14:58:39.579674	28_79_12
510	2025-03-20	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-24 14:58:39.579674	30_79_12
511	2025-03-20	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-24 14:58:39.579674	31_79_12
512	2025-03-20	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-24 14:58:39.579674	36_79_12
513	2025-03-20	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-24 14:58:39.579674	23_79_12
514	2025-03-20	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-24 14:58:39.579674	26_79_12
515	2025-03-20	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-24 14:58:39.579674	27_79_12
516	2025-03-20	馬鎮宮	\N	診所	330	\N	診所	5386	\N	2025-03-24 14:58:39.579674	29_79_12
517	2025-03-20	信智	\N	診所	140	\N	診所	61553	\N	2025-03-24 14:58:39.579674	32_79_12
518	2025-03-20	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-24 14:58:39.579674	33_79_12
519	2025-03-20	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-24 14:58:39.579674	35_79_12
520	2025-03-20	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-24 14:58:39.579674	22_79_12
521	2025-03-24	診所	\N	安定	500	\N	診所	5386	\N	2025-03-24 15:05:00.016038	12_83_13
526	2025-03-24	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-24 15:20:00.023577	16_83_13
529	2025-03-24	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-24 15:45:00.023499	20_83_13
418	2025-03-22	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-22 07:39:03.550431	23_81_12
419	2025-03-22	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-22 07:39:03.550431	27_81_12
494	2025-03-19	中華北路	和緯152	診所	200	\N	診所	533	\N	2025-03-24 14:58:39.579674	2_78_12
485	2025-03-19	診所	和緯152	中華北路	200	\N	診所	533	\N	2025-03-24 14:58:39.579674	7_78_12
420	2025-03-23	東洋	文南71	高鐵站	680	\N	東洋	5386	\N	2025-03-23 18:05:31.271601	44_82_12
421	2025-03-23	高鐵站	\N	東洋	680	\N	東洋	5386	\N	2025-03-23 18:05:31.271601	45_82_12
422	2025-03-24	診所	\N	大灣二街	275	\N	診所	533	\N	2025-03-24 11:34:21.586836	5_83_13
423	2025-03-24	診所	\N	長溪路	210	\N	診所	61553	\N	2025-03-24 11:34:21.586836	13_83_13
424	2025-03-24	診所	新建路	中華南路	220	\N	診所	28530	\N	2025-03-24 11:34:21.586836	19_83_13
425	2025-03-24	中華北路	\N	診所	135	\N	診所	533	\N	2025-03-24 11:34:21.586836	2_83_13
426	2025-03-24	和緯152	\N	診所	105	\N	診所	533	\N	2025-03-24 11:34:21.586836	3_83_13
427	2025-03-24	永大路	\N	診所	280	\N	診所	533	\N	2025-03-24 11:34:21.586836	6_83_13
428	2025-03-24	仁和路	\N	診所	220	\N	診所	533	\N	2025-03-24 11:34:21.586836	9_83_13
429	2025-03-24	安定	\N	診所	500	\N	診所	5386	\N	2025-03-24 11:34:21.586836	11_83_13
430	2025-03-24	中華南路	新建路	診所	220	\N	診所	28530	\N	2025-03-24 11:34:21.586836	17_83_13
431	2025-03-24	健康三街	府前二街	診所	250	\N	診所	28530	\N	2025-03-24 11:34:21.586836	18_83_13
432	2025-03-24	二井	\N	東洋	1400	\N	東洋	5386	\N	2025-03-24 11:34:21.586836	38_83_13
433	2025-03-24	久保田	新戶	東洋	360	\N	東洋	28530	\N	2025-03-24 11:34:21.586836	42_83_13
434	2025-03-24	大灣二街	\N	診所	275	\N	診所	533	\N	2025-03-24 11:34:21.586836	1_83_13
466	2025-03-18	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-24 13:59:32.556705	22_76_12
467	2025-03-18	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-24 13:59:32.556705	24_76_12
468	2025-03-18	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-24 13:59:32.556705	25_76_12
470	2025-03-18	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-24 13:59:32.556705	30_76_12
471	2025-03-18	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-24 13:59:32.556705	31_76_12
472	2025-03-18	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-24 13:59:32.556705	36_76_12
473	2025-03-18	古堡街	安北路+和緯五	診所	230	\N	診所	533	\N	2025-03-24 13:59:32.556705	23_76_12
474	2025-03-18	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-24 13:59:32.556705	26_76_12
475	2025-03-18	灣裡路	\N	診所	340	\N	診所	5386	\N	2025-03-24 13:59:32.556705	27_76_12
477	2025-03-18	信智	\N	診所	140	\N	診所	61553	\N	2025-03-24 13:59:32.556705	32_76_12
478	2025-03-18	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-24 13:59:32.556705	33_76_12
479	2025-03-18	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-24 13:59:32.556705	35_76_12
469	2025-03-18	診所	\N	灣裡路	340	\N	診所	28530	\N	2025-03-24 13:59:32.556705	28_76_12
476	2025-03-18	馬鎮宮	\N	診所	330	\N	診所	28530	\N	2025-03-24 13:59:32.556705	29_76_12
522	2025-03-24	診所	\N	安定	500	\N	診所	5386	\N	2025-03-24 15:05:00.013011	12_83_13
525	2025-03-24	診所	\N	永大路	280	\N	診所	61553	\N	2025-03-24 15:20:00.023577	16_83_13
530	2025-03-24	診所	府前二街	健康三街	250	\N	診所	28530	\N	2025-03-24 15:45:00.023499	20_83_13
550	2025-03-19	二井	\N	東洋	1400	\N	東洋	28530	\N	2025-03-24 16:24:04.227965	40_78_12
551	2025-03-19	久保田	新戶	東洋	360	\N	東洋	5386	\N	2025-03-24 16:24:04.227965	41_78_12
553	2025-03-19	東洋	\N	二井	1400	\N	東洋	5386	\N	2025-03-24 16:24:04.227965	39_78_12
554	2025-03-19	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-24 16:24:04.227965	43_78_12
587	2025-03-22	信智	\N	診所	140	\N	診所	61553	\N	2025-03-24 23:05:02.580261	32_81_12
588	2025-03-22	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-24 23:05:02.580261	33_81_12
589	2025-03-22	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-24 23:05:02.580261	35_81_12
590	2025-03-22	怡平路	忠孝街	診所	140	\N	診所	533	\N	2025-03-24 23:05:02.580261	22_81_12
595	2025-03-22	馬鎮宮	\N	診所	330	\N	診所	28530	\N	2025-03-24 23:05:02.580261	29_81_12
596	2025-03-22	診所	\N	灣裡路	340	\N	診所	28530	\N	2025-03-24 23:05:02.580261	28_81_12
597	2025-03-22	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	\N	2025-03-24 23:05:02.580261	24_81_12
598	2025-03-22	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-24 23:05:02.580261	25_81_12
599	2025-03-22	診所	\N	馬鎮宮	330	\N	診所	533	\N	2025-03-24 23:05:02.580261	30_81_12
600	2025-03-22	診所	文賢路	和緯四	140	\N	診所	533	\N	2025-03-24 23:05:02.580261	31_81_12
601	2025-03-22	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-24 23:05:02.580261	36_81_12
602	2025-03-22	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-24 23:05:02.580261	26_81_12
622	2025-03-25	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-25 17:35:00.018703	43_84_13
623	2025-03-25	東洋	新戶	久保田	360	\N	東洋	28530	\N	2025-03-25 17:35:00.018697	43_84_13
694	2025-03-29	公園南路	海安路	診所	90	\N	診所	533	\N	2025-03-29 10:22:15.051178	26_88_13
696	2025-03-29	診所	\N	忠孝街	85	\N	診所	533	\N	2025-03-29 10:52:39.259642	25_88_13
697	2025-03-29	和緯四	文賢路	診所	140	\N	診所	61553	\N	2025-03-29 10:52:39.259642	33_88_13
700	2025-03-29	南寧街	\N	診所	120	\N	診所	61553	\N	2025-03-29 11:15:00.019038	35_88_13
702	2025-03-29	診所	\N	南寧街	120	\N	診所	533	\N	2025-03-29 15:20:00.011357	36_88_13
\.


--
-- Data for Name: customers; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.customers (id, name, address, short_name, category, remarks) FROM stdin;
1	東洋先端科技	台南市安南區工業三路50號	東洋	東洋	\N
2	謝智超達恩診所	台南市中西區西門路二段375號3樓	診所	診所	\N
3	台南高鐵站	台南市歸仁區歸仁大道	高鐵站	東洋	\N
4	林明煌	台南市南區文南路71號	文南71	東洋	\N
5	胡昌吉	台南市永康區大灣二街	大灣二街	診所	\N
6	中華北路	台南市北區台南市北區中華北路一段105巷	中華北路	診所	\N
7	和緯路二段	台南市北區和緯路二段152號	和緯152	診所	\N
8	北門路二段	台南市北區北門路二段527巷口	北門二段	診所	\N
9	小北路	台南市北區小北路16號	小北路	診所	\N
10	民德路	台南市北區民德路105巷	民德105	診所	\N
11	永大路三段	台南市永康區永大路三段	永大路	診所	\N
12	中華南路	台南市南區中華南路二段	中華南路	診所	\N
13	新建路	台南市南區新建路	新建路	診所	\N
15	俊文	台南市中西區府前二街48號	府前二街	診所	\N
16	育德二路	台南市北區育德二路	育德二路	診所	\N
17	民德路58	台南市北區民德路58巷	民德58	診所	\N
18	怡平路	台南市安平區怡平路	怡平路	診所	\N
19	忠孝街	台南市中西區忠孝街	忠孝街	診所	\N
20	安北路	台南市安平區安北路	安北路	診所	\N
21	古堡街	台南市安平區古堡街	古堡街	診所	\N
22	和緯路五段	台南市安平區和緯路五段	和緯五	診所	\N
23	公園南路	台南市北區公園南路	公園南路	診所	\N
24	海安路二段	台南市中西區海安路二段	海安路	診所	\N
25	金華路二段	台南市南區金華路二段283號	金華路	診所	\N
26	灣裡馬鎮宮	台南市南區灣裡路	馬鎮宮	診所	\N
27	灣裡路	台南市南區灣裡路448巷	灣裡路	診所	\N
28	和緯路四段	台南市北區和緯路四段105巷	和緯四	診所	\N
29	文賢路	台南市北區文賢路	文賢路	診所	\N
30	信智	台南市北區北門路三段	信智	診所	\N
31	南寧街	台南市中西區南寧街	南寧街	診所	\N
32	仁和路	台南市東區仁和路111巷24號	仁和路	診所	\N
33	錦霞	台南市安定區安定里	安定	診所	\N
34	長溪路一段	台南市安南區長溪路一段	長溪路	診所	\N
35	同安路	台南市安南區同安路	同安路	診所	\N
36	二井	高雄市前鎮區中山二路198號	二井	東洋	\N
37	久保田	台南市北區公園南路站前CASA	久保田	東洋	\N
38	新戶	台南市北區公園南路站前CASA	新戶	東洋	\N
14	健康三街	台南市安平區健康三街12巷	健康三街	診所	\N
\.


--
-- Data for Name: drivers; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.drivers (id, name, plate_number, car_brand, car_model) FROM stdin;
5386	崔林彥	TDE-5386	Toyota	RAV4
28530	涂文峰	留空後補	Toyota	RAV4
533	黃清池	留空後補	Toyota	Camry
61553	蘇木山	留空後補	Toyota	Camry
61367	王華南	留空後補	Toyota	Cross
61379	黃榮章	留空後補	Toyota	Camry
\.


--
-- Data for Name: fixed_schedules; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.fixed_schedules (id, route_number, departure_time, start_point, via_point, end_point, base_fare, surcharge, category, driver_id, direction) FROM stdin;
5	135	10:40:00	診所	\N	大灣二街	275	\N	診所	533	回
7	135	12:10:00	診所	\N	中華北路	135	\N	診所	533	回
8	135	12:35:00	診所	\N	和緯152	105	\N	診所	533	回
10	135	14:40:00	診所	\N	仁和路	220	\N	診所	533	回
12	135	15:00:00	診所	\N	安定	500	\N	診所	5386	回
13	135	09:50:00	診所	\N	長溪路	210	\N	診所	61553	回
16	135	15:15:00	診所	\N	永大路	280	\N	診所	61553	回
19	135	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	回
20	135	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	回
21	135	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	回
24	246	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	回
25	246	10:50:00	診所	\N	忠孝街	85	\N	診所	533	回
28	246	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	回
30	246	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	回
31	246	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	回
36	246	15:15:00	診所	\N	南寧街	120	\N	診所	533	回
2	135	07:30:00	中華北路	\N	診所	135	\N	診所	533	來
3	135	08:00:00	和緯152	\N	診所	105	\N	診所	533	來
4	135	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	來
6	135	11:30:00	永大路	\N	診所	280	\N	診所	533	來
9	135	09:50:00	仁和路	\N	診所	220	\N	診所	533	來
11	135	10:00:00	安定	\N	診所	500	\N	診所	5386	來
14	135	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	來
15	135	14:50:00	同安路	\N	診所	220	\N	診所	61553	來
17	135	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	來
18	135	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	來
23	246	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	來
26	246	10:20:00	公園南路	海安路	診所	90	\N	診所	533	來
27	246	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	來
29	246	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	來
32	246	10:30:00	信智	\N	診所	140	\N	診所	61553	來
33	246	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	來
35	246	11:10:00	南寧街	\N	診所	120	\N	診所	61553	來
22	246	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	來
38	135	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	來
40	24	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	來
41	24	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	來
42	135	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	來
39	12345	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	回
43	12345	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	回
1	135	05:20:00	大灣二街	\N	診所	275	\N	診所	533	來
44	7	12:00:00	東洋	文南71	高鐵站	680	\N	東洋	5386	回
45	7	16:30:00	高鐵站	\N	東洋	680	\N	東洋	5386	來
\.


--
-- Data for Name: persons; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.persons (id, name, contact, email, role, remarks) FROM stdin;
\.


--
-- Data for Name: trips; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.trips (trip_id, fixed_trip_id, week_number, date, "time", start_point, via_point, end_point, meter_fare, extra_fare, category, driver_id, status, unique_code) FROM stdin;
1365	24	12	2025-03-20	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_76_12
1151	10	13	2025-03-24	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_83_13
1146	44	12	2025-03-23	12:00:00	東洋	文南71	高鐵站	680	\N	東洋	5386	已完成	44_82_12
1147	45	12	2025-03-23	16:30:00	高鐵站	\N	東洋	680	\N	東洋	5386	已完成	45_82_12
1152	12	13	2025-03-24	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_83_13
1148	5	13	2025-03-24	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_83_13
1153	13	13	2025-03-24	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_83_13
1155	19	13	2025-03-24	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_83_13
1158	2	13	2025-03-24	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_83_13
1159	3	13	2025-03-24	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_83_13
1161	6	13	2025-03-24	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_83_13
1162	9	13	2025-03-24	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_83_13
1163	11	13	2025-03-24	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_83_13
1166	17	13	2025-03-24	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_83_13
1167	18	13	2025-03-24	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_83_13
1168	38	13	2025-03-24	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_83_13
1149	7	13	2025-03-24	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_83_13
1157	21	13	2025-03-24	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_83_13
1150	8	13	2025-03-24	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_83_13
1154	16	13	2025-03-24	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_83_13
1156	20	13	2025-03-24	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_83_13
1294	7	12	2025-03-17	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_76_12
1295	8	12	2025-03-17	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_76_12
1296	10	12	2025-03-17	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_76_12
1297	12	12	2025-03-17	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_76_12
1298	13	12	2025-03-17	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_76_12
1299	16	12	2025-03-17	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_76_12
1300	19	12	2025-03-17	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_76_12
1301	20	12	2025-03-17	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_76_12
1302	21	12	2025-03-17	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_76_12
1303	2	12	2025-03-17	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_76_12
1304	3	12	2025-03-17	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_76_12
1305	4	12	2025-03-17	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_76_12
1307	9	12	2025-03-17	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_76_12
1308	11	12	2025-03-17	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_76_12
1309	14	12	2025-03-17	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_76_12
1310	15	12	2025-03-17	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_76_12
1311	17	12	2025-03-17	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_76_12
1312	18	12	2025-03-17	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_76_12
1313	38	12	2025-03-17	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_76_12
1314	40	12	2025-03-17	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_76_12
1315	41	12	2025-03-17	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_76_12
1316	42	12	2025-03-17	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_76_12
1317	39	12	2025-03-17	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_76_12
1318	43	12	2025-03-17	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_76_12
1319	1	12	2025-03-17	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_76_12
1334	40	12	2025-03-18	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	準備	40_76_12
1335	41	12	2025-03-18	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	準備	41_76_12
1336	39	12	2025-03-18	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	準備	39_76_12
1337	43	12	2025-03-18	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	準備	43_76_12
1333	22	12	2025-03-18	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_76_12
1320	24	12	2025-03-18	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_76_12
1321	25	12	2025-03-18	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_76_12
1322	28	12	2025-03-18	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_76_12
1323	30	12	2025-03-18	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_76_12
1324	31	12	2025-03-18	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_76_12
1325	36	12	2025-03-18	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_76_12
1326	23	12	2025-03-18	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_76_12
1327	26	12	2025-03-18	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_76_12
1328	27	12	2025-03-18	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_76_12
1169	42	13	2025-03-24	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_83_13
1172	1	13	2025-03-24	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_83_13
1174	25	13	2025-03-25	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_84_13
1450	10	12	2025-03-21	14:40:00	診所	\N	仁和路	0	\N	診所	533	已完成	10_80_12
1293	5	12	2025-03-17	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_76_12
1175	28	13	2025-03-25	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_84_13
1451	12	12	2025-03-21	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_80_12
1177	31	13	2025-03-25	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_84_13
1170	39	13	2025-03-24	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_83_13
1178	36	13	2025-03-25	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_84_13
1179	23	13	2025-03-25	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_84_13
1180	26	13	2025-03-25	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_84_13
1452	13	12	2025-03-21	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_80_12
1173	24	13	2025-03-25	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_84_13
1181	27	13	2025-03-25	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_84_13
1182	29	13	2025-03-25	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_84_13
1183	32	13	2025-03-25	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_84_13
1184	33	13	2025-03-25	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_84_13
1176	30	13	2025-03-25	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_84_13
1189	39	13	2025-03-25	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_84_13
1190	43	13	2025-03-25	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_84_13
1191	5	13	2025-03-26	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_85_13
1192	7	13	2025-03-26	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_85_13
1193	8	13	2025-03-26	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_85_13
1194	10	13	2025-03-26	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_85_13
1195	12	13	2025-03-26	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_85_13
1196	13	13	2025-03-26	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_85_13
1197	16	13	2025-03-26	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_85_13
1198	19	13	2025-03-26	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_85_13
1199	20	13	2025-03-26	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_85_13
1200	21	13	2025-03-26	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_85_13
1201	2	13	2025-03-26	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_85_13
1202	3	13	2025-03-26	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_85_13
1203	4	13	2025-03-26	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_85_13
1204	6	13	2025-03-26	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_85_13
1269	32	13	2025-03-29	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_88_13
1260	25	13	2025-03-29	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_88_13
1270	33	13	2025-03-29	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_88_13
1259	24	13	2025-03-29	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_88_13
1261	28	13	2025-03-29	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_88_13
1271	35	13	2025-03-29	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_88_13
1268	29	13	2025-03-29	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_88_13
1264	36	13	2025-03-29	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_88_13
1263	31	13	2025-03-29	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_88_13
1262	30	13	2025-03-29	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	準備	30_88_13
1366	25	12	2025-03-20	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_76_12
1367	28	12	2025-03-20	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_76_12
1368	30	12	2025-03-20	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_76_12
1369	31	12	2025-03-20	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_76_12
1370	36	12	2025-03-20	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_76_12
1371	23	12	2025-03-20	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_76_12
1372	26	12	2025-03-20	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_76_12
1373	27	12	2025-03-20	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_76_12
1374	29	12	2025-03-20	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_76_12
1375	32	12	2025-03-20	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_76_12
1221	36	13	2025-03-27	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_86_13
1306	6	12	2025-03-17	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_76_12
1222	23	13	2025-03-27	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_86_13
1223	26	13	2025-03-27	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_86_13
1266	26	13	2025-03-29	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_88_13
1329	29	12	2025-03-18	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_76_12
1330	32	12	2025-03-18	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_76_12
1331	33	12	2025-03-18	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_76_12
1332	35	12	2025-03-18	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_76_12
1466	18	12	2025-03-21	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_80_12
1467	38	12	2025-03-21	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_80_12
1185	35	13	2025-03-25	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_84_13
1468	40	12	2025-03-21	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_80_12
1484	32	12	2025-03-22	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_81_12
1469	41	12	2025-03-21	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_80_12
1186	22	13	2025-03-25	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_84_13
1470	42	12	2025-03-21	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_80_12
1485	33	12	2025-03-22	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_81_12
1338	5	12	2025-03-19	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_76_12
1339	7	12	2025-03-19	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_76_12
1340	8	12	2025-03-19	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_76_12
1341	10	12	2025-03-19	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_76_12
1342	12	12	2025-03-19	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_76_12
1343	13	12	2025-03-19	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_76_12
1344	16	12	2025-03-19	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_76_12
1345	19	12	2025-03-19	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_76_12
1346	20	12	2025-03-19	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_76_12
1347	21	12	2025-03-19	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_76_12
1348	2	12	2025-03-19	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_76_12
1349	3	12	2025-03-19	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_76_12
1350	4	12	2025-03-19	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_76_12
1351	6	12	2025-03-19	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_76_12
1352	9	12	2025-03-19	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_76_12
1353	11	12	2025-03-19	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_76_12
1354	14	12	2025-03-19	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_76_12
1355	15	12	2025-03-19	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_76_12
1356	17	12	2025-03-19	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_76_12
1357	18	12	2025-03-19	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_76_12
1358	38	12	2025-03-19	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_76_12
1359	40	12	2025-03-19	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_76_12
1360	41	12	2025-03-19	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_76_12
1361	42	12	2025-03-19	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_76_12
1362	39	12	2025-03-19	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_76_12
1363	43	12	2025-03-19	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_76_12
1364	1	12	2025-03-19	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_76_12
1164	14	13	2025-03-24	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_83_13
1376	33	12	2025-03-20	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_76_12
1377	35	12	2025-03-20	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_76_12
1378	22	12	2025-03-20	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_76_12
1379	40	12	2025-03-20	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_76_12
1380	41	12	2025-03-20	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_76_12
1381	39	12	2025-03-20	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_76_12
1382	43	12	2025-03-20	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_76_12
1165	15	13	2025-03-24	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_83_13
1471	39	12	2025-03-21	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_80_12
1187	40	13	2025-03-25	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_84_13
1472	43	12	2025-03-21	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_80_12
1486	35	12	2025-03-22	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_81_12
1473	1	12	2025-03-21	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_80_12
1188	41	13	2025-03-25	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_84_13
1487	22	12	2025-03-22	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_81_12
1206	11	13	2025-03-26	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_85_13
1207	14	13	2025-03-26	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_85_13
1208	15	13	2025-03-26	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_85_13
1209	17	13	2025-03-26	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_85_13
1210	18	13	2025-03-26	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_85_13
1211	38	13	2025-03-26	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_85_13
1212	42	13	2025-03-26	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_85_13
1213	39	13	2025-03-26	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_85_13
1383	5	12	2025-03-19	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_78_12
1384	7	12	2025-03-19	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_78_12
1385	8	12	2025-03-19	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_78_12
1386	10	12	2025-03-19	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_78_12
1387	12	12	2025-03-19	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_78_12
1388	13	12	2025-03-19	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_78_12
1389	16	12	2025-03-19	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_78_12
1390	19	12	2025-03-19	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_78_12
1391	20	12	2025-03-19	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_78_12
1392	21	12	2025-03-19	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_78_12
1393	2	12	2025-03-19	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_78_12
1394	3	12	2025-03-19	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_78_12
1395	4	12	2025-03-19	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_78_12
1396	6	12	2025-03-19	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_78_12
1397	9	12	2025-03-19	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_78_12
1398	11	12	2025-03-19	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_78_12
1399	14	12	2025-03-19	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_78_12
1400	15	12	2025-03-19	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_78_12
1401	17	12	2025-03-19	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_78_12
1402	18	12	2025-03-19	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_78_12
1403	38	12	2025-03-19	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_78_12
1404	42	12	2025-03-19	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_78_12
1405	1	12	2025-03-19	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_78_12
1406	24	12	2025-03-20	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_79_12
1407	25	12	2025-03-20	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_79_12
1408	28	12	2025-03-20	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_79_12
1409	30	12	2025-03-20	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_79_12
1410	31	12	2025-03-20	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_79_12
1411	36	12	2025-03-20	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_79_12
1412	23	12	2025-03-20	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_79_12
1413	26	12	2025-03-20	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_79_12
1414	27	12	2025-03-20	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_79_12
1415	29	12	2025-03-20	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_79_12
1416	32	12	2025-03-20	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_79_12
1417	33	12	2025-03-20	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_79_12
1418	35	12	2025-03-20	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_79_12
1419	22	12	2025-03-20	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_79_12
1160	4	13	2025-03-24	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_83_13
1171	43	13	2025-03-24	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_83_13
1488	40	12	2025-03-22	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_81_12
1489	41	12	2025-03-22	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_81_12
1490	39	12	2025-03-22	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_81_12
1491	43	12	2025-03-22	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_81_12
1483	29	12	2025-03-22	11:50:00	馬鎮宮	\N	診所	330	\N	診所	28530	已完成	29_81_12
1476	28	12	2025-03-22	11:00:00	診所	\N	灣裡路	340	\N	診所	28530	已完成	28_81_12
1474	24	12	2025-03-22	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_81_12
1475	25	12	2025-03-22	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_81_12
1205	9	13	2025-03-26	09:50:00	仁和路	\N	診所	220	\N	診所	533	取消	9_85_13
1439	40	12	2025-03-19	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_78_12
1440	41	12	2025-03-19	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_78_12
1442	39	12	2025-03-19	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_78_12
1443	43	12	2025-03-19	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_78_12
1447	5	12	2025-03-21	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_80_12
1448	7	12	2025-03-21	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_80_12
1480	23	12	2025-03-22	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	準備	23_81_12
1449	8	12	2025-03-21	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_80_12
1482	27	12	2025-03-22	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	準備	27_81_12
1453	16	12	2025-03-21	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_80_12
1214	43	13	2025-03-26	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_85_13
1454	19	12	2025-03-21	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_80_12
1215	1	13	2025-03-26	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_85_13
1455	20	12	2025-03-21	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_80_12
1216	24	13	2025-03-27	11:00:00	診所	和緯五+安北路+古堡街	怡平路	270	\N	診所	533	已完成	24_86_13
1456	21	12	2025-03-21	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_80_12
1217	25	13	2025-03-27	10:50:00	診所	\N	忠孝街	85	\N	診所	533	已完成	25_86_13
1457	2	12	2025-03-21	07:30:00	中華北路	\N	診所	0	\N	診所	533	已完成	2_80_12
1218	28	13	2025-03-27	11:00:00	診所	\N	灣裡路	340	\N	診所	5386	已完成	28_86_13
1458	3	12	2025-03-21	08:00:00	和緯152	\N	診所	0	\N	診所	533	已完成	3_80_12
1219	30	13	2025-03-27	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_86_13
1459	4	12	2025-03-21	15:25:00	北門二段	小北路+民德105	診所	0	\N	診所	533	已完成	4_80_12
1220	31	13	2025-03-27	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_86_13
1460	6	12	2025-03-21	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_80_12
1224	27	13	2025-03-27	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_86_13
1461	9	12	2025-03-21	09:50:00	仁和路	\N	診所	0	\N	診所	533	已完成	9_80_12
1225	29	13	2025-03-27	11:50:00	馬鎮宮	\N	診所	330	\N	診所	5386	已完成	29_86_13
1462	11	12	2025-03-21	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_80_12
1226	32	13	2025-03-27	10:30:00	信智	\N	診所	140	\N	診所	61553	已完成	32_86_13
1463	14	12	2025-03-21	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_80_12
1227	33	13	2025-03-27	10:50:00	和緯四	文賢路	診所	140	\N	診所	61553	已完成	33_86_13
1464	15	12	2025-03-21	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_80_12
1228	35	13	2025-03-27	11:10:00	南寧街	\N	診所	120	\N	診所	61553	已完成	35_86_13
1465	17	12	2025-03-21	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_80_12
1477	30	12	2025-03-22	16:00:00	診所	\N	馬鎮宮	330	\N	診所	533	已完成	30_81_12
1478	31	12	2025-03-22	15:30:00	診所	文賢路	和緯四	140	\N	診所	533	已完成	31_81_12
1479	36	12	2025-03-22	15:15:00	診所	\N	南寧街	120	\N	診所	533	已完成	36_81_12
1481	26	12	2025-03-22	10:20:00	公園南路	海安路	診所	90	\N	診所	533	已完成	26_81_12
1229	22	13	2025-03-27	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_86_13
1230	40	13	2025-03-27	06:20:00	二井	\N	東洋	1400	\N	東洋	28530	已完成	40_86_13
1231	41	13	2025-03-27	07:10:00	久保田	新戶	東洋	360	\N	東洋	5386	已完成	41_86_13
1232	39	13	2025-03-27	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_86_13
1233	43	13	2025-03-27	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_86_13
1234	5	13	2025-03-28	10:40:00	診所	\N	大灣二街	275	\N	診所	533	已完成	5_87_13
1235	7	13	2025-03-28	12:10:00	診所	\N	中華北路	135	\N	診所	533	已完成	7_87_13
1236	8	13	2025-03-28	12:35:00	診所	\N	和緯152	105	\N	診所	533	已完成	8_87_13
1237	10	13	2025-03-28	14:40:00	診所	\N	仁和路	220	\N	診所	533	已完成	10_87_13
1238	12	13	2025-03-28	15:00:00	診所	\N	安定	500	\N	診所	5386	已完成	12_87_13
1239	13	13	2025-03-28	09:50:00	診所	\N	長溪路	210	\N	診所	61553	已完成	13_87_13
1240	16	13	2025-03-28	15:15:00	診所	\N	永大路	280	\N	診所	61553	已完成	16_87_13
1241	19	13	2025-03-28	11:15:00	診所	新建路	中華南路	220	\N	診所	28530	已完成	19_87_13
1242	20	13	2025-03-28	15:40:00	診所	府前二街	健康三街	250	\N	診所	28530	已完成	20_87_13
1243	21	13	2025-03-28	15:00:00	診所	民德58	育德二路	110	\N	診所	28530	已完成	21_87_13
1244	2	13	2025-03-28	07:30:00	中華北路	\N	診所	135	\N	診所	533	已完成	2_87_13
1245	3	13	2025-03-28	08:00:00	和緯152	\N	診所	105	\N	診所	533	已完成	3_87_13
1246	4	13	2025-03-28	15:25:00	北門二段	小北路+民德105	診所	165	\N	診所	533	已完成	4_87_13
1247	6	13	2025-03-28	11:30:00	永大路	\N	診所	280	\N	診所	533	已完成	6_87_13
1248	9	13	2025-03-28	09:50:00	仁和路	\N	診所	220	\N	診所	533	已完成	9_87_13
1249	11	13	2025-03-28	10:00:00	安定	\N	診所	500	\N	診所	5386	已完成	11_87_13
1250	14	13	2025-03-28	14:30:00	育德二路	民德58	診所	90	\N	診所	61553	已完成	14_87_13
1251	15	13	2025-03-28	14:50:00	同安路	\N	診所	220	\N	診所	61553	已完成	15_87_13
1252	17	13	2025-03-28	06:20:00	中華南路	新建路	診所	220	\N	診所	28530	已完成	17_87_13
1253	18	13	2025-03-28	10:50:00	健康三街	府前二街	診所	250	\N	診所	28530	已完成	18_87_13
1254	38	13	2025-03-28	06:20:00	二井	\N	東洋	1400	\N	東洋	5386	已完成	38_87_13
1255	42	13	2025-03-28	07:10:00	久保田	新戶	東洋	360	\N	東洋	28530	已完成	42_87_13
1256	39	13	2025-03-28	17:30:00	東洋	\N	二井	1400	\N	東洋	5386	已完成	39_87_13
1257	43	13	2025-03-28	17:30:00	東洋	新戶	久保田	360	\N	東洋	28530	已完成	43_87_13
1258	1	13	2025-03-28	05:20:00	大灣二街	\N	診所	275	\N	診所	533	已完成	1_87_13
1265	23	13	2025-03-29	06:30:00	古堡街	安北路+和緯五	診所	230	\N	診所	533	已完成	23_88_13
1267	27	13	2025-03-29	06:20:00	灣裡路	\N	診所	340	\N	診所	5386	已完成	27_88_13
1272	22	13	2025-03-29	06:00:00	怡平路	忠孝街	診所	140	\N	診所	533	已完成	22_88_13
\.


--
-- Name: completed_trips_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.completed_trips_id_seq', 703, true);


--
-- Name: customers_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.customers_id_seq', 1, false);


--
-- Name: persons_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.persons_id_seq', 1, false);


--
-- Name: trips_trip_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.trips_trip_id_seq', 1491, true);


--
-- Name: completed_trips completed_trips_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_pkey PRIMARY KEY (id);


--
-- Name: customers customers_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.customers
    ADD CONSTRAINT customers_pkey PRIMARY KEY (id);


--
-- Name: customers customers_short_name_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.customers
    ADD CONSTRAINT customers_short_name_key UNIQUE (short_name);


--
-- Name: drivers drivers_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.drivers
    ADD CONSTRAINT drivers_pkey PRIMARY KEY (id);


--
-- Name: fixed_schedules fixed_schedules_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.fixed_schedules
    ADD CONSTRAINT fixed_schedules_pkey PRIMARY KEY (id);


--
-- Name: persons persons_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.persons
    ADD CONSTRAINT persons_pkey PRIMARY KEY (id);


--
-- Name: trips trips_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_pkey PRIMARY KEY (trip_id);


--
-- Name: idx_completed_trips_date; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_completed_trips_date ON public.completed_trips USING btree (date);


--
-- Name: idx_completed_trips_driver; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_completed_trips_driver ON public.completed_trips USING btree (driver_id);


--
-- Name: idx_trips_date; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_trips_date ON public.trips USING btree (date);


--
-- Name: idx_trips_driver; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_trips_driver ON public.trips USING btree (driver_id);


--
-- Name: idx_trips_status; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_trips_status ON public.trips USING btree (status);


--
-- Name: customers trigger_set_customer_id; Type: TRIGGER; Schema: public; Owner: postgres
--

CREATE TRIGGER trigger_set_customer_id BEFORE INSERT ON public.customers FOR EACH ROW EXECUTE FUNCTION public.set_customer_id();


--
-- Name: drivers trigger_set_driver_id; Type: TRIGGER; Schema: public; Owner: postgres
--

CREATE TRIGGER trigger_set_driver_id BEFORE INSERT ON public.drivers FOR EACH ROW EXECUTE FUNCTION public.set_driver_id();


--
-- Name: fixed_schedules trigger_set_schedule_id; Type: TRIGGER; Schema: public; Owner: postgres
--

CREATE TRIGGER trigger_set_schedule_id BEFORE INSERT ON public.fixed_schedules FOR EACH ROW EXECUTE FUNCTION public.set_schedule_id();


--
-- Name: completed_trips completed_trips_driver_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_driver_id_fkey FOREIGN KEY (driver_id) REFERENCES public.drivers(id);


--
-- Name: completed_trips completed_trips_end_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_end_point_fkey FOREIGN KEY (end_point) REFERENCES public.customers(short_name);


--
-- Name: completed_trips completed_trips_start_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.completed_trips
    ADD CONSTRAINT completed_trips_start_point_fkey FOREIGN KEY (start_point) REFERENCES public.customers(short_name);


--
-- Name: trips trips_driver_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_driver_id_fkey FOREIGN KEY (driver_id) REFERENCES public.drivers(id);


--
-- Name: trips trips_end_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_end_point_fkey FOREIGN KEY (end_point) REFERENCES public.customers(short_name);


--
-- Name: trips trips_fixed_trip_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_fixed_trip_id_fkey FOREIGN KEY (fixed_trip_id) REFERENCES public.fixed_schedules(id);


--
-- Name: trips trips_start_point_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.trips
    ADD CONSTRAINT trips_start_point_fkey FOREIGN KEY (start_point) REFERENCES public.customers(short_name);


--
-- PostgreSQL database dump complete
--

--
-- Database "dispatch_system" dump
--

--
-- PostgreSQL database dump
--

-- Dumped from database version 14.17 (Homebrew)
-- Dumped by pg_dump version 14.17 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: dispatch_system; Type: DATABASE; Schema: -; Owner: postgres
--

CREATE DATABASE dispatch_system WITH TEMPLATE = template0 ENCODING = 'UTF8' LOCALE = 'C';


ALTER DATABASE dispatch_system OWNER TO postgres;

\connect dispatch_system

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- PostgreSQL database dump complete
--

--
-- Database "postgres" dump
--

\connect postgres

--
-- PostgreSQL database dump
--

-- Dumped from database version 14.17 (Homebrew)
-- Dumped by pg_dump version 14.17 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- PostgreSQL database dump complete
--

--
-- PostgreSQL database cluster dump complete
--

